INSERT INTO teachers (first_name, middle_name, last_name) VALUES
('Мария', 'Евгеньевна', 'Петрова'),
('Иван', 'Сергеевич', 'Сидоров'),
('Ольга', 'Николаевна', 'Козлова');

INSERT INTO school_classes (class_name) VALUES ('10А');

INSERT INTO schedules (subject, date, start_time, end_time, room_number, teacher_id, class_id) VALUES
('Математика', 'MONDAY', '09:00', '10:30', '201', 1, 1),
('Физика', 'MONDAY', '10:45', '12:15', '301', 2, 1),
('Литература', 'MONDAY', '12:30', '14:00', '105', 1, 1),
('Химия', 'TUESDAY', '09:00', '10:30', '401', 2, 1),
('История', 'TUESDAY', '10:45', '12:15', '102', 1, 1),
('Английский', 'TUESDAY', '12:30', '14:00', '205', 2, 1),
('Биология', 'WEDNESDAY', '09:00', '10:30', '402', 2, 1),
('География', 'WEDNESDAY', '10:45', '12:15', '103', 1, 1),
('Физкультура', 'WEDNESDAY', '12:30', '14:00', 'Спортзал', 2, 1),
('Информатика', 'THURSDAY', '09:00', '10:30', '301', 2, 1),
('Обществознание', 'THURSDAY', '10:45', '12:15', '102', 1, 1),
('Русский язык', 'THURSDAY', '12:30', '14:00', '105', 1, 1),
('Музыка', 'FRIDAY', '09:00', '10:30', '206', 2, 1),
('ИЗО', 'FRIDAY', '10:45', '12:15', '207', 1, 1),
('Технология', 'FRIDAY', '12:30', '14:00', '208', 2, 1);